---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsTrisertypeRiserStyle
source: html/f629a515-a95c-dee3-4705-b9cdd0c6456f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsTrisertypeRiserStyle Property

"Riser Type": (OBSOLETE)

## Syntax (C#)
```csharp
public static ForgeTypeId StairsTrisertypeRiserStyle { get; }
```